Revit 2026 API
WireMaterialTypeSetIterator Constructor
For Internal Use Only.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public WireMaterialTypeSetIterator()
Public Sub New
public:
WireMaterialTypeSetIterator()
new : unit -> WireMaterialTypeSetIterator
Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.
See Also
Reference
WireMaterialTypeSetIterator Class
Autodesk.Revit.DB.Electrical Namespace